Repository: rinrinne/IDEA_resources_jp
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Statement ''{0}'' not supported
ja: ステートメント ''{0}'' はサポートされていません

source: Statements to &evaluate:
ja: 評価するステートメント(&E):

source: Static &final fields
ja: static final フィールドを表示する(&F)

source: Static field:
ja: 静的フィールド :

source: Static fields
ja: 静的フィールド

source: Static methods
ja: 静的メソッド

source: Statistics
ja: 統計情報

source: Stepping into
ja: ステップ イン

source: Stepping out
ja: ステップ アウト

source: Stepping over
ja: ステップ オーバー

source: Stop
ja: 停止

source: Stop Searching
ja: 検索の中止

source: Stop _Macro Recording
ja: マクロの記録を終了(_M)

source: Stop background search
ja: バックグラウンド検索を停止

source: Stopped at cursor
ja: カーソルで停止しました

source: Strikeout
ja: 取り消し線付き

source: String
ja: 文字列

source: String//Escape Sequence//Invalid
ja: 文字列//エスケープシーケンス//不正

source: String//Escape Sequence//Valid
ja: 文字列//エスケープシーケンス//適正

source: String//String text
ja: 文字列//文字列テキスト

source: Strip trailing spaces on Save:
ja: 保存時に行末のスペースを削除する:

source: Style
ja: スタイル

source: Submission failed
ja: 送信は失敗しました

source: Submit
ja: 提出

source: Submitted
ja: 提出済み

source: Substitution not allowed
ja: 代入できません

source: Subtypes Hierarchy
ja: サブタイプ階層

source: Subtypes of {0}
ja: {0} のサブタイプ

source: Such sequence of targets already exists
ja: ターゲットのシーケンスは既に存在します

source: Such usages make code excessive and thus less readable.
ja: これらの呼び出しを行うと、コードが難解になります。

source: Suggest package local visibility level for class members
ja: クラス メンバのパッケージ ローカル可視レベルを示す

source: Suggest package local visibility level for top-level classes
ja: トップレベル クラスのパッケージ ローカル可視レベルを示す

source: Supertypes Hierarchy
ja: スーパータイプ階層

source: Supertypes of {0}
ja: {0} のスーパータイプ

source: Support paired &parens
ja: 組になる小括弧 ( ) をサポート(&P)

source: Support paired b&races
ja: 組になる中括弧 { } をサポート(&R)

source: Support paired bra&ckets
ja: 組になる大括弧 [ ] をサポート(&C)

source: Suppress all inspections for class
ja: クラスのすべての検査を抑止

source: Suppress with @SuppressWarnings (for Java 5.0 only)
ja: @SuppressWarnings で抑止する (Java SDK 5.0 のみ)

source: Surround With Try / Catch
ja: Try / Catch で囲む

source: Surround expression with
ja: 式を囲む

source: Surround statements with
ja: 文を囲む

source: Surround with try/catch
ja: try/catch句 で囲む

source: Surrounded expression is null
ja: 囲まれた式は NULL です

source: Suspend
ja: サスペンド

source: Suspicious call to ''{0}''
ja: 疑わしい ''{0}'' への呼び出し

source: Suspicious collections method calls
ja: 疑わしいコレクション メソッド呼び出し

source: Switch to Class Hierarchy
ja: クラス階層に切り替え

source: Switch to Subtypes Hierarchy
ja: サブタイプ階層に切り替え

source: Synchronize ''{0}''
ja: ''{0}'' の同期

source: Synchronize files on frame or editor tab activation
ja: フレームの切り替え時やエディタのタブ変更時にファイルを同期する

source: Synchronize selected files
ja: 選択したファイルの同期

source: Syntax
ja: 構文

source: Syntax Highlighting
ja: 構文強調表示

source: Syntax analysis
ja: 構文修正を解析しています。

source: Syntax aware selection
ja: 構文認識選択

source: Syntax printing
ja: 構文を印刷する

source: System Error
ja: システム エラー

source: System Settings
ja: システム設定

source: System-Dependent
ja: システム依存

source: Tab Appearance
ja: タブの外観

source: Tab Closing Policy
ja: タブの終了ルール

source: Tab limit:
ja: タブ数の制限 :

source: Tab size:
ja: タブの文字数:

source: Tabs and Indents
ja: タブとインデント

source: Tag
ja: タグ

source: Tag Name
ja: タグ名称

source: Tag name
ja: タグ名称

source: Target VM does not support modification watchpoints
ja: ターゲット VM はウォッチポイントの変更をサポートしません

source: Target virtual machine closed connection
ja: ターゲット仮想マシンは接続を閉じました

source: Target:
ja: ターゲット:

source: Target: {0}
ja: ターゲット: {0}

source: Targets:
ja: ターゲット:

source: Task:
ja: タスク:

source: Template Project Settings
ja: テンプレート プロジェクト設定

source: Template Settings
ja: テンプレート設定

source: Templates//Template variable
ja: テンプレート//テンプレート変数

source: Terminate Ant process?
ja: Ant プロセスを中止しますか ?

source: Terminate it?
ja: 中止しますか ?

source: Terminate the process after disconnect
ja: 切断後にプロセスを中止

source: Terminated
ja: 中止

source: Terminating ''{0}''
ja: '{0}'' を中止しています

source: Ternary operation
ja: 三項演算

source: Test
ja: テスト

source: Test Class
ja: テスト クラス

source: Test Method
ja: テスト メソッド

source: Test if a node can be expanded (optional):
ja: ノードを展開できるかどうかをテストする(オプション):

source: Test method ''{0}'' doesn''t exist
ja: テスト メソッド "{0}" は存在しません

source: Test runner pa&rams:
ja: テスト ランナ パラメータ(&R):

source: Test:
ja: テスト:

source: Tests Failed
ja: テスト不合格

source: Tests Passed
ja: テスト合格

source: Tests in ''{0}''
ja: "{0}" のテスト

source: Tests in Progress
ja: テスト実行中

source: Tests passed (with warnings)
ja: テスト合格 (警告あり)

source: Tests were not started
ja: テストは開始しませんでした

source: Text files
ja: テキスト ファイル

source: Text line
ja: テキスト行

source: Text to &find:
ja: 検索する文字列(&T):

source: Text//Background in readonly files
ja: 読み取り専用ファイルのバックグラウンド

source: Text//Default text
ja: テキスト//デフォルト テキスト

source: Text//Deleted text
ja: テキスト//削除したテキスト

source: Text//Folded text
ja: テキスト//折り返しテキスト

source: Text//Readonly fragment background
ja: 読み取り専用フラグメント バックグラウンド

source: Thank you for evaluating {0}.<br>Your evaluation license expires in {1}<br><br>{2}
ja: {0} の評価版のご使用ありがとうございます。<br>評価版ライセンスの使用期限は {1}<br><br>{2}

source: The "{0}" is not an {1} module file (.iml)
ja: "{0}" は {1} モジュール ファイル (.iml) ではありません

source: The access code is invalid.
ja: アクセス コードが無効です。

source: The application is running
ja: アプリケーションが実行中です

source: The checkboxes below may be used to further specialize whether this inspection should report strings in:
ja: この検査で以下の文字列を報告するには、該当するチェックボックスをオンにします :

source: The data is invalid.
ja: データは無効です。

source: The debuggee VM version is "1.4.0".
ja: デバッグする VM バージョンは "1.4.0" です。

source: The declared exception {0} is never thrown
ja: 宣言した {0} は、スローされません。

source: The declared exception {0} is never thrown in method implementations
ja: 宣言した例外 {0} は、メソッドの実装ではスローされません。

source: The declared exception {0} is never thrown in this method, nor in its derivables
ja: 宣言した {0} は、このメソッドおよび派生ではスローされません。

source: The default icon will be added to this action.
ja: デフォルト アイコンをこのアクションに追加します。

source: The device does not recognize the command.
ja: デバイスはコマンドを認識しません。

source: The device is not ready.
ja: デバイスは使用できません。

source: The directory cannot be removed.
ja: ディレクトリは削除できません。

source: The directory of the project file
ja: プロジェクト ファイルのディレクトリ

source: The drive cannot find the sector requested.
ja: 要求したセクタがありません。

source: The drive cannot locate a specific area or track on the disk.
ja: ドライブは特定の領域またはトラックをディスクに割り当てられません。

source: The environment is incorrect.
ja: 環境が不正です。

source: The file ''{0}'' already exists.
ja: ファイル ''{0}'' は、既に存在します。

source: The file ''{0}'' is not associated with any file type.
ja: 拡張子 ''{0}'' は登録したファイル タイプと関連付けられていません 1 つ選択してください :

source: The file does not exist.
ja: ファイルは存在しません。

source: The file {0} contains no settings to import.
ja: ファイル {0} にはインポートする設定が含まれていません。

source: The following directory will be marked as a source directory:
ja: 次のディレクトリをソース ディレクトリとしてマークします :

source: The following resource patterns are malformed:{0}
ja: 次のリソース パターンは不正な形式です:{0}

source: The format of resource patterns has changed.
ja: リソース パターンのフォーマットが変更されました。

source: The handle is invalid.
ja: ハンドルは無効です。

source: The license is per-seat and cannot be used by different users concurrently.
ja: ライセンスは複数のコンピュータで同時に使用できません。

source: The media is write protected.
ja: このメディアは書き込み禁止です。

source: The method is empty
ja: このメソッドは空です。

source: The module content root
ja: モジュール コンテント ルート

source: The module file directory
ja: モジュール ファイル ディレクトリ

source: The module file will be saved in selected directory
ja: モジュール ファイルを選択したディレクトリに保存します

source: The name of the project file without extension
ja: 拡張子なしのプロジェクト ファイル名

source: The operation will not affect them.
ja: 操作はそれらに影響しません。

source: The path of the project file
ja: プロジェクトファイルのパス

source: The period is used by the Javadoc tool to generate the comment for the overview page
ja: ピリオドは javadoc tool により使用され、概要ページのコメントを生成します。

source: The port to attach to unspecified
ja: アタッチするポートが指定されていません

source: The port to listen at unspecified
ja: リスナが監視するポートが指定されていません

source: The program issued a command but the command length is incorrect.
ja: プログラムはコマンドを発行しましたが、コマンドの長さが不正です。

source: The project file is read-only.
ja: プロジェクト ファイルが読み取り専用です。

source: The settings will not be saved until you make the file writable.
ja: 設定はファイルを書き込み可能に変更するまで保存されません。

source: The shortcut is already assigned to other actions.
ja: ショートカットは既に他のアクションに割り当てられています。

source: The source code for all modules in the cycle will be compiled into the main module's output folders; All modules in the cycle will use the JDK assigned to the main module; Any JAR files created will be named after the name of the main module.
ja: 循環内のすべてのモジュールのソース コードはメイン モジュールの出力フォルダにコンパイルされます。循環内のすべてのモジュールは、メイン モジュールに指定された JDK を使用します。作成された jar アーカイブは、メイン モジュールの名前より命名されます。

source: The specified disk or diskette cannot be accessed.
ja: 指定したディスクまたはディスケットにアクセスできません。

source: The specified file is a directory.
ja: 指定したファイルはディレクトリです。

source: The specified path to module file does not exist
ja: 指定されたモジュール ファイルへのパスは存在しません

source: The storage control block address is invalid.
ja: ストレージ制御ブロックアドレスは無効です。

source: The storage control blocks were destroyed.
ja: ストレージ制御ブロックが破損しました。

source: The system cannot find the device specified.
ja: 指定したデバイスはありません。

source: The system cannot find the drive specified.
ja: 指定したドライブはありません。

source: The system cannot find the file specified.
ja: 指定したファイルはありません。

source: The system cannot find the path specified.
ja: 指定したパスはありません。

source: The system cannot move the file to a different disk drive.
ja: ファイルを他のディスク ドライブに移動できません。

source: The system cannot open the file.
ja: ファイルを開けません。

source: The template is editable.
ja: このテンプレートは編集可能です。

source: The value changed at {0} is never used
ja: {0} で変更した値は使用されません。

source: The value will be recalculated
ja: 値は再計算されます

source: The value {0} assigned to {1} is never used
ja: {1} に代入する値 {0} は使用されません。

source: The {0} directory
ja: ディレクトリ{0}

source: The {1} file ''{0}'' already exists.
ja: {1} ファイル ''{0}'' は既に存在します。

source: There are no more files.
ja: ファイルはこれ以上ありません。

source: There is a quickfix provided that transforms a Java code string literal into a java.util.ResourceBundle.getString() method call.
ja: Java コード文字列リテラルを java.util.ResourceBundle.getString()メソッド呼び出しに変換するクイックフィックスが提供されています。

source: There is already a macro called ''{0}''.
ja: マクロ ''{0}'' は既に存在します。

source: There is no executable code at {0}:{1}
ja: 実行コードは {0} にありません :{1}

source: There is nothing to display.
ja: 表示項目がありません。

source: There was {1}
ja: {1} が存在します。

source: There were plugins without id found, all such plugins were skipped.
ja: ID のないプラグインがありました。それらすべてのプラグインはスキップされました。

source: These paths correspond to default (root, unnamed, top level) packages.
ja: これらのパスはデフォルト (ルート、名称未設定、トップレベル) パッケージに対応する必要があります。

source: This Class
ja: このクラス

source: This document contains very long lines.
ja: この文書は、とても長い行を含んでいます。

source: This inspection analyzes method control and data flow to report possible conditions that are always true or false, expressions whose value is statically proven to be constant, and situations that can lead to nullability contract violations.
ja: この検査は、コードのデータ フロー分析に基づいて、常に true または falseとなるような条件文や、値が一定であると静的に証明されたり、ヌル値になる契約違反を導くような表現を報告します。

source: This inspection detects violations of rules specified for dependency validation.
ja: この検査は、依存関係の検証に指定されたルールの違反を検出します。

source: This inspection finds all usages of methods that have @since tag in their documentation.
ja: この検査は、ドキュメントに @since 1.5タグが含まれるメソッドの使用箇所をすべて検索します。

source: This inspection points out the cases where a variable value is never used after its assignment, i.e.:
ja: この検査は、以下のように、変数が代入後に使用されないケースを指摘します :

source: This inspection points out the following javadoc comment flaws:
ja: この検査は、以下の javadoc コメントの問題点を指摘します :

source: This inspection reports all calls to parametrized methods where explicit argument types can be omitted, since they will be unambiguously inferred by compiler.
ja: この検査は、コンパイラによって明白に推測されるために明示的な引数の型が省略可能な、パラメータ化されたメソッドへの呼び出しをすべて報告します。

source: This inspection reports all fields, methods or classes, found in the specified inspection scope, that may have a final modifier added to their declarations.
ja: この検査は、指定された検査範囲で見つかった宣言に final 修飾子が追加できる、フィールド、メソッドまたはクラスをすべて報告します。

source: This inspection reports all fields, methods or classes, found in the specified inspection scope, that may have a static modifier added to their declarations.
ja: この検査は、指定された検査範囲で見つかった宣言に static 修飾子が追加できる、フィールド、メソッドまたはクラスをすべて報告します。

source: This inspection reports all fields, methods or classes, found in the specified inspection scope, that may have their access modifier narrowed down.
ja: この検査は、指定された検査範囲で見つかった、アクセス修飾子が絞り込まれた、フィールド、メソッドまたはクラスをすべて報告します。

source: This inspection reports all properties not referenced from outside of the properties file.
ja: この検査は、プロパティ ファイルの未使用プロパティをすべて報告します。

source: This inspection reports all string literals which are replicated unchanged throughout the project.
ja: この検査は、プロジェクト全体にわたって複製され変更されなかった文字列リテラルをすべて報告します。

source: This inspection reports any instances of hardcoded String literals.
ja: この検査は、ハードコードされている文字列リテラルのインスタンスを報告します。

source: This inspection reports classes that override method equals() but do not override method hashCode() , or vice versa, which could potentially lead to problems when class is added to a Collection .
ja: この検査は、クラスがコレクションに追加されるときに問題を引き起こす可能性がある、メソッド equals() をオーバーライドしてメソッド hashCode() をオーバーライドしないクラス、またはその逆のクラスを報告します。

source: This inspection reports method calls to parameterized collections, where actual argument type does not correspond to the collection's elements type.
ja: この検査は、実際の引数の型がコレクションの要素の型と対応していない、パラメータ化されたコレクションへのメソッド呼び出しを報告します。

source: This inspection reports methods and method hierarchies where the return value appears to be always the same constant.
ja: この検査は、戻り値が常に同じ定数であると思われるメソッドおよびメソッド階層を報告します。

source: This inspection reports methods where a value being passed to a particular parameter appears to be always the same constant.
ja: この検査は、特定のパラメータに渡されている値が常に同じ定数であると思われるメソッドを報告します。

source: This inspection reports methods where:
ja: この検査は、以下のメソッドを報告します :

source: This inspection reports methods which return values are never used in corresponding method calls.
ja: この検査は、戻り値が対応するメソッド呼び出しで使用されないメソッドを報告します。

source: This inspection reports parameters or local variables, found in the specified inspection scope, that may have a final modifier added.
ja: この検査は、指定された検査範囲で見つかった、final修飾子が追加できる、パラメータまたはローカル変数を報告します。

source: This inspection reports parameters that are not used by their methods and all method implementations/overriders.
ja: この検査は、メソッドおよびすべてのメソッド実装/オーバーライドで使用されないパラメータを報告します。

source: This inspection reports problems related to @Nullable and @NotNull annotations usage configured in Constant conditions & exceptions inspection.
ja: この検査は、@Nullable および @NotNull 注釈の使用箇所に関連する問題を報告します。

source: This inspection reports unnecessary cast expressions.
ja: この検査は、不必要なキャスト式を報告します。

source: This inspection reports unnecessary creation of array expression to be passed as an argument to varargs parameter.
ja: この検査は、varargs パラメータに引数として渡される配列式の不必要な作成を報告します。

source: This inspection reports where deprecated code is used in the specified inspection scope.
ja: この検査は、指定された検査範囲で使用されている非推奨コードを報告します。

source: This inspection searches for redundant class fields that can be replaced with local variables.
ja: この検査は、ローカル変数と置換できる冗長なクラス フィールドを検索します。

source: This inspection won't report empty strings and strings consisting of only whitespace.
ja: この検査は、空の文字列と空白のみからなる文字列のインスタンスは報告しません。

source: This intention adds @Nullable/@NotNull annotation on the selected element (externally in case of library)
ja: このインテンションは、選択された要素に @Nullable/@NotNull アノテーションを追加します。 （外部ライブラリの場合）

source: This intention adds runtime exception under cursor to the current method throws clause.
ja: このインテンションは、現在のメソッドの throw 句にカーソルの下のランタイム例外を追加します。

source: This intention adds standard Java 5.0 annotation @Override to the method which has been found to override non-abstract method in the base class.
ja: このインテンションは、ベース クラスの非抽象メソッドをオーバーライドするメソッドに、標準 Java 5.0 注釈 @Override を追加します。

# This intention allows to break line on ' ' and ' ' line break symbols.
source: This intention allows to break line on '\n' and '\n\r' line break symbols.
ja: このインテンションは、'\n' と '\n\r'が改行記号で改行できるようにします。

source: This intention allows to convert between new Color(int rgb) and new Color(int r, int g, int b) constructor variants.
ja: このインテンションは、new Color(int rgb)と new Color(int r, int g, int b)の異なるコンストラクタの変換をできるようにします。

source: This intention allows to create or assign multiple fields from method parameters.
ja: このインテンションは、メソッドのパラメータから 複数フィールドの作成や割り当てをできるようにします。

source: This intention converts absolute path to relative (if applicable).
ja: このインテンションは、絶対パスを相対パスに変換します(該当する場合)。

source: This intention converts selected qualified reference into simple reference and adds static import ( Java 5.0 feature) for corresponding class.
ja: このインテンションは、選択した修飾参照を単純参照に変換して、対応するクラスに static import (Java 5.0 機能) を追加します。

source: This intention converts selected qualified reference into simple reference and adds corresponding static import ( Java 5.0 feature) for that reference.
ja: このインテンションは、選択した修飾参照を単純参照に変換して、その参照に対応する static import (Java 5.0 機能) を追加します。

source: This intention converts string concatenation expressions to calling java.text.MessageFormat.format method generating appropriate format string and arguments
ja: このインテンションは、文字列結合式を適切なフォーマットの文字列と引数を生成する java.text.MessageFormat.format メソッドの呼び出しに変換します。

source: This intention converts type to atomic
ja: このインテンションは、アトミックに型を変換します。

source: This intention inserts statement assigning parameter to the same-named field.
ja: このインテンションは、同じ名前のフィールドにパラメータを代入する文を挿入します。

source: This intention shows color chooser dialog and replaces existing new Color expression with the values of the choosen color.
ja: このインテンションは、色選択のダイアログを表示し、選択した色の値を持つ 新しい色に置き換えられます。

source: This is a built-in template used each time you create a new Java class, by selecting New | Java Class | Class from the popup menu in one of the project views.
ja: これは、プロジェクト ビューのポップアップ メニューから [新規] - [クラス]> を選択して、新規 Java クラスを作成するときに使用されるビルトイン テンプレートです。

source: This is a built-in template used each time you create a new Java interface, by selecting New | Java Class | Interface from the popup menu in one of the project views.
ja: これは、プロジェクト ビューのポップアップ メニューから [新規] - [インターフェイス] を選択して、新規 Java インターフェイスを作成するときに使用されるビルトイン テンプレートです。

source: This is a built-in template used for filling the body of a catch block when it is generated, e.g. when using the Code | Surround with... function.
ja: これは、例えば、[コード] - [囲む...] 機能を使用して、プログラムが catch 文のボディを生成するときに使用されるビルトイン テンプレートです。

source: This is a built-in template used for filling the body of a method when it is generated, e.g. when using the Create method from usage intention action.
ja: これは、例えば、使用箇所からのメソッドの作成アクションを使用して、プログラムがメソッドのボディを生成するときに使用されるビルトイン テンプレートです。

source: This is a built-in template used for filling the body of an implemented method when it is generated, e.g. when using the Implement abstract class or Implement Abstract Method intention actions or calling the Code | Implement Method... function.
ja: これは、例えば、抽象クラスの実装/抽象メソッドの実装アクションを使用して、または [コード] - [メソッドのインポート...] 機能を呼び出して、プログラムが実装したメソッドのボディを生成するときに使用されるビルトイン テンプレートです。

source: This is a built-in template used for filling the body of an overridden method each time it is generated by the program, e.g. when calling the Code | Override Method... function.
ja: これは、例えば、[コード] - [メソッドのオーバーライド...] 機能を使用して、プログラムがオーバーライドされたメソッドのボディを生成するときに使用されるビルトイン テンプレートです。

source: This is a built-in template.
ja: これはビルトインテンプレートです。

source: This is the original Java string literal value.
ja: オリジナルの Java 文字列リテラル値。

source: This license is being used elsewhere on the network by {0}.
ja: このライセンスはネットワーク上の他の場所で {0} により使用されています。

source: This may be useful when development is performed under newer SDK version as the target platform for production.
ja: 製品のターゲット プラットフォームに対して、開発をより新しいSDKで行う場合に便利です。

source: This path should correspond to default (root, unnamed, top level) package.
ja: このパスはデフォルト (ルート、名称未設定、トップレベル) パッケージに対応する必要があります。

source: Thread
ja: スレッド

source: Thread ''{0}'' has been garbage-collected
ja: スレッド ''{0}'' はガベージ コレクトされています

source: Thread has been resumed
ja: スレッドが再開されました

source: Thread has no frames
ja: スレッドにはフレームがありません

source: Thread is running
ja: スレッドが実行中です

source: Threading issues
ja: スレッド化問題

source: Threads
ja: スレッド

source: Throws list
ja: スロー リスト

source: Time elapsed
ja: 経過時間

source: Tip of the Day
ja: ヒント

source: Tips not found.
ja: ヒントがありません。

source: To New Subgroup...
ja: 新規サブ グループへ...

source: To This Group
ja: このグループへ

source: To add item to favorites list use: Main Menu -> View -> Add To Favorites
ja: お気に入りリストへのアイテム追加 : [メイン メニュー] - [表示] - [お気に入りに追加]

source: To get JPDA libraries please visit
ja: JPDA ライブラリを入手するには次を参照してください

source: Today
ja: 今日

source: Toggle tree/text mode
ja: ツリー/テキスト モードの切り替え

source: Too many IDE fatal errors.
ja: 多数の IDE の致命的なエラー 。

source: Top
ja: 上

source: Total:
ja: 合計 :

source: Track Running Test
ja: 実行しているテストのトラック

source: Transform {0} into final one element array
ja: ''{0}'' を final の 1 つの要素配列に変形する

source: Transparency
ja: 透過性

source: Transport:
ja: トランスポート :

source: Tree View
ja: ツリー ビュー

source: Try again
ja: 再試行してください

source: Try to generify ''{0}''
ja: ''{0}'' を一般化する

source: Two modules in a project cannot share the same content root.
ja: プロジェクト内の 2 つのモジュールは同じコンテント ルートを共有できません。

source: Type cast parentheses
ja: 型キャストの小括弧

source: Type is unknown for ''{0}''
ja: ''{0}'' のタイプが不明です

source: Type mismatch
ja: タイプの不一致

source: Typically it is the value that is used for ResourceBundle.getString() method parameter.
ja: 通常は、ResourceBundle.getString() メソッド パラメータに使用された値。

source: Typing
ja: 入力

source: UI Designer Form
ja: UI デザイナ フォーム

source: UI Options
ja: ユーザー インターフェイス オプション

source: UI Usability Features
ja: UI の便利な機能

source: UNKNOWN
ja: 不明

source: URL/HTML &file:
ja: URL/HTML ファイル(&F):

source: Un&scrambler:
ja: 分解器:

source: Unable To Add Favorites List
ja: お気に入りリストに追加できません

source: Unable to Save Data
ja: データを保存できません

source: Unable to add action without icon to the toolbar
ja: ツールバーへのアイコンを指定せずにアクションは追加できません

source: Unable to evaluate the expression
ja: 式を評価できません

source: Unable to import settings.
ja: 設定をインポートできません 。

source: Unable to open debugger port
ja: デバッガのポートを開けません

source: Unable to perform an action since it changes read-only fragments of the current document
ja: 現在のファイルは読み取り専用のため、処理を実行できません

source: Uncaught excepti&on
ja: 未捕捉の例外(&O)

source: Unchecked warning
ja: 未チェックの警告

source: Uncomment the following property if no tests compilation is needed
ja: テスト コンパイラが不要な場合は次のプロパティを非コメント化する

source: Under construction
ja: 準備中

source: Underscored
ja: 下線付き

source: Underwaved
ja: 波線付き

source: Undo
ja: 取り消し

source: Undo {0}
ja: {0} の取り消し

source: Unfreeze
ja: フリーズしない

source: Uninstall
ja: プラグインのアンインストール

source: Unknown
ja: 不明

source: Unknown version
ja: 不明なバージョン

source: Unnamed
ja: 名前未設定

source: Unnamed{0}
ja: 名称未設定{0}

source: Unp_in Active Tab
ja: アクティブ タブの固定解除(_I)

source: Unp_in Tab
ja: タブの固定解除(_I)

source: Unread.
ja: 未読。

source: Unsupported class version : {0}
ja: サポートされないクラスのバージョン : {0}

source: Unsupported expression type
ja: サポートされない式タイプ

source: Unused assignment
ja: 使用しない代入

source: Unused import (editor light)
ja: 未使用の import (editor light)

source: Unused import statement
ja: 未使用の import 文

source: Unused method parameters
ja: 未使用のメソッド パラメータ

source: Unused symbol
ja: 未使用のシンボル

source: Update Plugin
ja: プラグインのアップデート

source: Usage After
ja: テスト後使用箇所

source: Usage Before
ja: テスト前使用箇所

source: Usage Delta
ja: 差分使用箇所

source: Usage of API documented as @since {0}+
ja: @since {0} + で文書化された API の使用方法
